//  Напишите программу, 
//  которая на вход принимает два числа и выдаёт, 
//  какое число большее, а какое меньшее.

Console.WriteLine("Введите первое целое число:");
int a = ConConsole.ReadLine()